RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S6X/middleware/sdmmc/sdio/fsl_sdio.c
static status_t SDIO_ExecuteTuning(sdio_card_t *card)
{
    assert(card != NULL);

    return SDMMCHOST_ExecuteTuning(card->host, (uint32_t)kSD_SendTuningBlock,
                                   (uint32_t *)FSL_SDMMC_CARD_INTERNAL_BUFFER_ALIGN_ADDR(card->internalBuffer), 64U);
}

static status_t SDIO_SendRca(sdio_card_t *card)
{
    assert(card != NULL);

    uint32_t i = FSL_SDMMC_MAX_CMD_RETRIES;

    sdmmchost_transfer_t content = {0};
    sdmmchost_cmd_t command      = {0};
    status_t error               = kStatus_Success;

    command.index        = (uint32_t)kSDIO_SendRelativeAddress;
    command.argument     = 0U;
    command.responseType = kCARD_ResponseTypeR6;
    command.responseErrorFlags =
        (uint32_t)kSDIO_StatusR6Error | (uint32_t)kSDIO_StatusIllegalCmd | (uint32_t)kSDIO_StatusCmdCRCError;

    content.command = &command;
    content.data    = NULL;

    while (--i != 0U)
    {
        error = SDMMCHOST_TransferFunction(card->host, &content);
        if (kStatus_Success == error)
        {
            /* check illegal state and cmd CRC error, may be the voltage or clock not stable, retry the cmd*/
            if ((command.response[0U] & ((uint32_t)kSDIO_StatusIllegalCmd | (uint32_t)kSDIO_StatusCmdCRCError)) != 0U)
            {
                continue;
            }

            card->relativeAddress = (command.response[0U] >> 16U);

            return kStatus_Success;
        }
    }

    return kStatus_SDMMC_TransferFailed;
}

status_t SDIO_CardInActive(sdio_card_t *card)
{
    assert(card != NULL);

    return SDMMC_SetCardInactive(card->host);
}

static status_t SDIO_SendOperationCondition(sdio_card_t *card, uint32_t argument, uint32_t *accept1V8)
{
    assert(card != NULL);

    sdmmchost_transfer_t content = {0U};
    sdmmchost_cmd_t command      = {0U};
    uint32_t i                   = SDIO_RETRY_TIMES;
    status_t error               = kStatus_Success;

    command.index        = (uint32_t)kSDIO_SendOperationCondition;
    command.argument     = argument;
    command.responseType = kCARD_ResponseTypeR4;

    content.command = &command;
    content.data    = NULL;

    while (--i != 0U)
    {
        error = SDMMCHOST_TransferFunction(card->host, &content);
        if ((kStatus_Success != error) || (command.response[0U] == 0U))
        {
            continue;
        }

        /* if argument equal 0, then should check and save the info */
        if ((argument != 0U) && ((command.response[0U] & SDMMC_MASK(kSDIO_OcrPowerUpBusyFlag)) == 0U))
        {
            continue;
        }
        else if (argument == 0U)
        {
            /* check the io number and ocr value */
            if ((((command.response[0U] & SDIO_OCR_IO_NUM_MASK) >> kSDIO_OcrIONumber) == 0U) ||
                ((command.response[0U] & 0xFFFFFFU) == 0U))
            {
                return kStatus_Fail;
            }

            break;
        }
        else
        {
            /* check if memory present */
            if ((command.response[0U] & SDMMC_MASK(kSDIO_OcrMemPresent)) == SDMMC_MASK(kSDIO_OcrMemPresent))
            {
                card->memPresentFlag = true;
            }
            /* save the io number */
            card->ioTotalNumber = (uint8_t)((command.response[0U] & SDIO_OCR_IO_NUM_MASK) >> kSDIO_OcrIONumber);
            /* save the operation condition */
            card->ocr = command.response[0U] & 0xFFFFFFU;
            if (accept1V8 != NULL)
            {
                *accept1V8 = command.response[0U] & 0x1000000U;
            }

            break;
        }
    }

    return ((i != 0U) ? kStatus_Success : kStatus_Fail);
}

static status_t SDIO_IO_Access_Direct(sdio_card_t *card,
                                      sdio_io_direction_t direction,
                                      sdio_func_num_t func,
                                      uint32_t regAddr,
                                      uint8_t dataIn,
                                      uint8_t *dataOut,
                                      bool rawFlag)
{
    assert(card != NULL);
    assert(func <= kSDIO_FunctionNum7);

    sdmmchost_transfer_t content = {0U};
    sdmmchost_cmd_t command      = {0U};
    status_t error               = kStatus_Success;

    command.index    = (uint32_t)kSDIO_RWIODirect;
    command.argument = ((uint32_t)func << SDIO_CMD_ARGUMENT_FUNC_NUM_POS) |
                       ((regAddr & SDIO_CMD_ARGUMENT_REG_ADDR_MASK) << SDIO_CMD_ARGUMENT_REG_ADDR_POS);

    if ((dataOut != NULL) && (direction == kSDIO_IOWrite))
    {
        command.argument |= (1UL << SDIO_CMD_ARGUMENT_RW_POS) | ((uint32_t)rawFlag << SDIO_DIRECT_CMD_ARGUMENT_RAW_POS);
    }

    if (direction == kSDIO_IOWrite)
    {
        command.argument |= (uint32_t)dataIn & SDIO_DIRECT_CMD_DATA_MASK;
    }

    command.responseType = kCARD_ResponseTypeR5;
    command.responseErrorFlags =
        ((uint32_t)kSDIO_StatusCmdCRCError | (uint32_t)kSDIO_StatusIllegalCmd | (uint32_t)kSDIO_StatusError |
         (uint32_t)kSDIO_StatusFunctionNumError | (uint32_t)kSDIO_StatusOutofRange);

    content.command = &command;
    content.data    = NULL;
    error           = SDMMCHOST_TransferFunction(card->host, &content);
    if (kStatus_Success != error)
    {
        error = kStatus_SDMMC_TransferFailed;
    }

    if ((error == kStatus_Success) && (dataOut != NULL))
    {
        /* read data from response */
        *dataOut = (uint8_t)(command.response[0U] & SDIO_DIRECT_CMD_DATA_MASK);
    }

    return error;
}

status_t SDIO_IO_Write_Direct(sdio_card_t *card, sdio_func_num_t func, uint32_t regAddr, uint8_t *data, bool raw)
{
    assert(card != NULL);
    assert(func <= kSDIO_FunctionNum7);

    status_t error = kStatus_Success;

    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    error = SDIO_IO_Access_Direct(card, kSDIO_IOWrite, func, regAddr, *data, data, raw);
    if (kStatus_Success != error)
    {
        error = kStatus_SDMMC_TransferFailed;
    }

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

status_t SDIO_IO_Read_Direct(sdio_card_t *card, sdio_func_num_t func, uint32_t regAddr, uint8_t *data)
{
    assert(card != NULL);
    assert(func <= kSDIO_FunctionNum7);

