RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S6X/middleware/sdmmc/sdio/fsl_sdio.c
    status_t error = kStatus_Success;

    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    error = SDIO_IO_Access_Direct(card, kSDIO_IORead, func, regAddr, 0, data, false);
    if (kStatus_Success != error)
    {
        error = kStatus_SDMMC_TransferFailed;
    }

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

status_t SDIO_IO_RW_Direct(sdio_card_t *card,
                           sdio_io_direction_t direction,
                           sdio_func_num_t func,
                           uint32_t regAddr,
                           uint8_t dataIn,
                           uint8_t *dataOut)
{
    assert(card != NULL);
    assert(func <= kSDIO_FunctionNum7);

    status_t error = kStatus_Success;

    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    error = SDIO_IO_Access_Direct(card, direction, func, regAddr, dataIn, dataOut, true);
    if (kStatus_Success != error)
    {
        error = kStatus_SDMMC_TransferFailed;
    }

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

status_t SDIO_IO_Write_Extended(
    sdio_card_t *card, sdio_func_num_t func, uint32_t regAddr, uint8_t *buffer, uint32_t count, uint32_t flags)
{
    assert(card != NULL);
    assert(buffer != NULL);
    assert(func <= kSDIO_FunctionNum7);

    sdmmchost_transfer_t content = {0U};
    sdmmchost_cmd_t command      = {0U};
    sdmmchost_data_t data        = {0U};
    bool blockMode               = false;
    bool opCode                  = false;
    status_t error               = kStatus_Success;

    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    /* check if card support block mode */
    if (((card->cccrflags & (uint32_t)kSDIO_CCCRSupportMultiBlock) != 0U) &&
        ((flags & SDIO_EXTEND_CMD_BLOCK_MODE_MASK) != 0U))
    {
        blockMode = true;
    }

    if ((flags & SDIO_EXTEND_CMD_OP_CODE_MASK) != 0U)
    {
        opCode = true;
    }

    /* check the byte size counter in non-block mode
     * so you need read CIS for each function first,before you do read/write
     */
    if (!blockMode)
    {
        if ((func == kSDIO_FunctionNum0) && (card->commonCIS.fn0MaxBlkSize != 0U) &&
            (count > card->commonCIS.fn0MaxBlkSize))
        {
            error = kStatus_SDMMC_SDIO_InvalidArgument;
        }
        else if ((func != kSDIO_FunctionNum0) && (card->funcCIS[(uint32_t)func - 1U].ioMaxBlockSize != 0U) &&
                 (count > card->funcCIS[(uint32_t)func - 1U].ioMaxBlockSize))
        {
            error = kStatus_SDMMC_SDIO_InvalidArgument;
        }
        else
        {
            /* Intentional empty */
        }
    }

    if (error == kStatus_Success)
    {
        command.index    = (uint32_t)kSDIO_RWIOExtended;
        command.argument = ((uint32_t)func << SDIO_CMD_ARGUMENT_FUNC_NUM_POS) |
                           ((regAddr & SDIO_CMD_ARGUMENT_REG_ADDR_MASK) << SDIO_CMD_ARGUMENT_REG_ADDR_POS) |
                           (1UL << SDIO_CMD_ARGUMENT_RW_POS) | (count & SDIO_EXTEND_CMD_COUNT_MASK) |
                           ((blockMode ? 1UL : 0UL) << SDIO_EXTEND_CMD_ARGUMENT_BLOCK_MODE_POS |
                            ((opCode ? 1UL : 0UL) << SDIO_EXTEND_CMD_ARGUMENT_OP_CODE_POS));
        command.responseType = kCARD_ResponseTypeR5;
        command.responseErrorFlags =
            ((uint32_t)kSDIO_StatusCmdCRCError | (uint32_t)kSDIO_StatusIllegalCmd | (uint32_t)kSDIO_StatusError |
             (uint32_t)kSDIO_StatusFunctionNumError | (uint32_t)kSDIO_StatusOutofRange);

        if (blockMode)
        {
            if (func == kSDIO_FunctionNum0)
            {
                data.blockSize = card->io0blockSize;
            }
            else
            {
                data.blockSize = card->ioFBR[(uint32_t)func - 1U].ioBlockSize;
            }
            data.blockCount = count;
        }
        else
        {
            data.blockSize  = count;
            data.blockCount = 1U;
        }
        data.txData = (uint32_t *)(uint32_t)buffer;

        content.command = &command;
        content.data    = &data;
        error           = SDMMCHOST_TransferFunction(card->host, &content);
        if (kStatus_Success != error)
        {
            error = kStatus_SDMMC_TransferFailed;
        }
    }

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

status_t SDIO_IO_Read_Extended(
    sdio_card_t *card, sdio_func_num_t func, uint32_t regAddr, uint8_t *buffer, uint32_t count, uint32_t flags)
{
    assert(card != NULL);
    assert(buffer != NULL);
    assert(func <= kSDIO_FunctionNum7);

    sdmmchost_transfer_t content = {0U};
    sdmmchost_cmd_t command      = {0U};
    sdmmchost_data_t data        = {0U};
    bool blockMode               = false;
    bool opCode                  = false;
    status_t error               = kStatus_Success;

    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    /* check if card support block mode */
    if (((card->cccrflags & (uint32_t)kSDIO_CCCRSupportMultiBlock) != 0U) &&
        ((flags & SDIO_EXTEND_CMD_BLOCK_MODE_MASK) != 0U))
    {
        blockMode = true;
    }

    /* op code =0 : read/write to fixed addr
     *  op code =1 :read/write addr incrementing
     */
    if ((flags & SDIO_EXTEND_CMD_OP_CODE_MASK) != 0U)
    {
        opCode = true;
    }

    /* check the byte size counter in non-block mode
     * so you need read CIS for each function first,before you do read/write
     */
    if (!blockMode)
    {
        if ((func == kSDIO_FunctionNum0) && (card->commonCIS.fn0MaxBlkSize != 0U) &&
            (count > card->commonCIS.fn0MaxBlkSize))
        {
            error = kStatus_SDMMC_SDIO_InvalidArgument;
        }
        else if ((func != kSDIO_FunctionNum0) && (card->funcCIS[(uint32_t)func - 1U].ioMaxBlockSize != 0U) &&
                 (count > card->funcCIS[(uint32_t)func - 1U].ioMaxBlockSize))
        {
            error = kStatus_SDMMC_SDIO_InvalidArgument;
        }
        else
        {
            /* Intentional empty */
        }
    }

    if (error == kStatus_Success)
    {
        command.index    = (uint32_t)kSDIO_RWIOExtended;
        command.argument = ((uint32_t)func << SDIO_CMD_ARGUMENT_FUNC_NUM_POS) |
                           ((regAddr & SDIO_CMD_ARGUMENT_REG_ADDR_MASK) << SDIO_CMD_ARGUMENT_REG_ADDR_POS) |
                           (count & SDIO_EXTEND_CMD_COUNT_MASK) |
                           ((blockMode ? 1UL : 0UL) << SDIO_EXTEND_CMD_ARGUMENT_BLOCK_MODE_POS |
                            ((opCode ? 1UL : 0UL) << SDIO_EXTEND_CMD_ARGUMENT_OP_CODE_POS));
        command.responseType = kCARD_ResponseTypeR5;
        command.responseErrorFlags =
            ((uint32_t)kSDIO_StatusCmdCRCError | (uint32_t)kSDIO_StatusIllegalCmd | (uint32_t)kSDIO_StatusError |
             (uint32_t)kSDIO_StatusFunctionNumError | (uint32_t)kSDIO_StatusOutofRange);

        if (blockMode)
        {
            if (func == kSDIO_FunctionNum0)
            {
                data.blockSize = card->io0blockSize;
            }
            else
            {
                data.blockSize = card->ioFBR[(uint32_t)func - 1U].ioBlockSize;
            }
            data.blockCount = count;
        }
        else
        {
            data.blockSize  = count;
            data.blockCount = 1U;
        }
        data.rxData = (uint32_t *)(uint32_t)buffer;

        content.command = &command;
        content.data    = &data;
        error           = SDMMCHOST_TransferFunction(card->host, &content);
        if (kStatus_Success != error)
        {
            error = kStatus_SDMMC_TransferFailed;
        }
    }

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

status_t SDIO_IO_Transfer(sdio_card_t *card,
                          sdio_command_t cmd,
                          uint32_t argument,
                          uint32_t blockSize,
                          uint8_t *txData,
                          uint8_t *rxData,
                          uint16_t dataSize,
                          uint32_t *response)
{
    assert(card != NULL);

    uint32_t actualSize          = dataSize;
    sdmmchost_transfer_t content = {0U};
    sdmmchost_cmd_t command      = {0U};
    sdmmchost_data_t data        = {0U};
    uint32_t i                   = SDIO_RETRY_TIMES;
    uint32_t *dataAddr           = (uint32_t *)(uint32_t)(txData == NULL ? rxData : txData);
    uint8_t *alignBuffer         = (uint8_t *)FSL_SDMMC_CARD_INTERNAL_BUFFER_ALIGN_ADDR(card->internalBuffer);
    status_t error               = kStatus_Fail;

    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    if ((dataSize != 0U) && (txData != NULL) && (rxData != NULL))
    {
        error = kStatus_InvalidArgument;
    }
    else
    {
        command.index        = (uint32_t)cmd;
        command.argument     = argument;
        command.responseType = kCARD_ResponseTypeR5;
        command.responseErrorFlags =
            ((uint32_t)kSDIO_StatusCmdCRCError | (uint32_t)kSDIO_StatusIllegalCmd | (uint32_t)kSDIO_StatusError |
             (uint32_t)kSDIO_StatusFunctionNumError | (uint32_t)kSDIO_StatusOutofRange);
        content.command = &command;
        content.data    = NULL;

        if (dataSize != 0U)
        {
            /* if block size bigger than 1, then use block mode */
            if ((argument & SDIO_EXTEND_CMD_BLOCK_MODE_MASK) != 0U)
            {
                if (dataSize % blockSize != 0U)
                {
                    actualSize = ((dataSize / blockSize) + 1U) * blockSize;
                }

                data.blockCount = actualSize / blockSize;
                data.blockSize  = blockSize;
            }
            else
            {
                data.blockCount = 1;
                data.blockSize  = dataSize;
            }
            /* if data buffer address can not meet host controller internal DMA requirement, sdio driver will try to use
             * internal align buffer if data size is not bigger than internal buffer size,
             * Align address transfer always can get a better performance, so if you want sdio driver make buffer
             * address align, you should redefine the SDMMC_GLOBAL_BUFFER_SIZE macro to a value which is big enough for
             * your application.
             */
            if (
#if SDMMCHOST_DMA_DESCRIPTOR_BUFFER_ALIGN_SIZE != 1U
                (((uint32_t)dataAddr & (SDMMCHOST_DMA_DESCRIPTOR_BUFFER_ALIGN_SIZE - 1U)) != 0U) &&
#endif
                (actualSize <= FSL_SDMMC_DEFAULT_BLOCK_SIZE) && (!card->noInternalAlign))
            {
                dataAddr = (uint32_t *)(uint32_t)alignBuffer;
                (void)memset(alignBuffer, 0, actualSize);
                if (txData != NULL)
                {
                    (void)memcpy(alignBuffer, txData, dataSize);
                }
            }

            if (rxData != NULL)
            {
                data.rxData = dataAddr;
            }
            else
            {
                data.txData = dataAddr;
            }

            content.data = &data;
        }

        do
        {
            error = SDMMCHOST_TransferFunction(card->host, &content);
            if (kStatus_Success == error)
            {
                if ((rxData != NULL) && (dataSize != 0U) &&
#if SDMMCHOST_DMA_DESCRIPTOR_BUFFER_ALIGN_SIZE != 1U
                    (((uint32_t)rxData & (SDMMCHOST_DMA_DESCRIPTOR_BUFFER_ALIGN_SIZE - 1U)) != 0U) &&
#endif
                    (actualSize <= FSL_SDMMC_DEFAULT_BLOCK_SIZE) && (!card->noInternalAlign))
                {
                    (void)memcpy(rxData, alignBuffer, dataSize);
                }

                if (response != NULL)
                {
                    *response = command.response[0];
                }

                error = kStatus_Success;
                break;
            }

            i--;
        } while (i != 0U);
    }

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

status_t SDIO_GetCardCapability(sdio_card_t *card, sdio_func_num_t func)
{
    assert(card != NULL);
    assert(func <= kSDIO_FunctionNum7);

    uint8_t *tempBuffer = (uint8_t *)FSL_SDMMC_CARD_INTERNAL_BUFFER_ALIGN_ADDR(card->internalBuffer);
    uint32_t i          = 0U;
    status_t error      = kStatus_Success;

    (void)memset(tempBuffer, 0, SDIO_CCCR_REG_NUMBER);

    for (i = 0U; i <= SDIO_CCCR_REG_NUMBER; i++)
    {
        error = SDIO_IO_Access_Direct(card, kSDIO_IORead, kSDIO_FunctionNum0, SDIO_FBR_BASE((uint32_t)func) + i, 0U,
                                      &tempBuffer[i], false);
        if (kStatus_Success != error)
        {
            return kStatus_SDMMC_TransferFailed;
        }
    }

    switch (func)
    {
        case kSDIO_FunctionNum0:

            card->sdVersion    = tempBuffer[kSDIO_RegSDVersion];
            card->sdioVersion  = tempBuffer[kSDIO_RegCCCRSdioVer] >> 4U;
            card->cccrVersioin = tempBuffer[kSDIO_RegCCCRSdioVer] & 0xFU;
            /* continuous SPI interrupt */
            if ((tempBuffer[kSDIO_RegBusInterface] & 0x40U) != 0U)
            {
                card->cccrflags |= (uint32_t)kSDIO_CCCRSupportContinuousSPIInt;
            }
            /* 8bit data bus */
            if ((tempBuffer[kSDIO_RegBusInterface] & 0x4U) != 0U)
            {
                card->cccrflags |= SDIO_CCCR_SUPPORT_8BIT_BUS;
            }

            /* card capability register */
            card->cccrflags |= (tempBuffer[kSDIO_RegCardCapability] & 0xDFUL);
            /* master power control */
            if ((tempBuffer[kSDIO_RegPowerControl] & 0x01U) != 0U)
            {
                card->cccrflags |= (uint32_t)kSDIO_CCCRSupportMasterPowerControl;
            }
            /* high speed flag */
            if ((tempBuffer[kSDIO_RegBusSpeed] & 0x01U) != 0U)
            {
                card->cccrflags |= SDIO_CCCR_SUPPORT_HIGHSPEED;
            }
            /* uhs mode flag */
            card->cccrflags |= (tempBuffer[kSDIO_RegUHSITimingSupport] & 7UL) << 11U;
            /* driver type flag */
            card->cccrflags |= (tempBuffer[kSDIO_RegDriverStrength] & 7UL) << 14U;
            /* low speed 4bit */
            if ((tempBuffer[kSDIO_RegCardCapability] & 0x80U) != 0U)
            {
                card->cccrflags |= (uint32_t)kSDIO_CCCRSupportLowSpeed4Bit;
            }
            /* common CIS pointer */
            card->commonCISPointer = tempBuffer[kSDIO_RegCommonCISPointer] |
                                     ((uint32_t)tempBuffer[(uint32_t)kSDIO_RegCommonCISPointer + 1U] << 8U) |
                                     ((uint32_t)tempBuffer[(uint32_t)kSDIO_RegCommonCISPointer + 2U] << 16U);

